# Document Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevisionsOnSheetUIServiceData..::..Document Property
RevisionsOnSheetUIServiceData Class See Also
---
return the document
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Document Document { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Document As Document
	Get
```

Visual C++
---
```text
public:
property Document^ Document {
	Document^ get ();
}
```

# See Also
RevisionsOnSheetUIServiceData Class
Autodesk.Revit.UI Namespace